In [2]:
import pandas as pd
import numpy as np

# 1 Creating a dataframes from an array

## 1.1 Option 1

In [4]:
#Creating an array

data = np.array([[1, 4], [2, 5], [3, 6]])

In [7]:
# Creating DataFrame

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])

In [8]:
# Display the DataFrame

df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## 1.2 Option 2

In [14]:
# Creating an array with a list shape

data = [[1, 4], [2, 5], [3, 6]]

In [15]:
# Creating a DataFrame

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])

In [16]:
# Display the DataFrame

df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2 Creating DataFrame from Dictionary

In [20]:
# List used for the dataframe

states = ['Tamil Nadu', 'Kerala', 'Gujarat', 'Karnataka', 'Manipur', 'Nagaland']
population = [77222000, 35432678, 71234765, 61343585, 2345765, 1934757]

In [21]:
# Storing list within the dictionary

dict_states = {'States': states, 'Population': population}

In [22]:
dict_states

{'States': ['Tamil Nadu',
  'Kerala',
  'Gujarat',
  'Karnataka',
  'Manipur',
  'Nagaland'],
 'Population': [77222000, 35432678, 71234765, 61343585, 2345765, 1934757]}

In [23]:
df_population = pd.DataFrame(dict_states)

In [24]:
df_population

       States  Population
0  Tamil Nadu    77222000
1      Kerala    35432678
2     Gujarat    71234765
3   Karnataka    61343585
4     Manipur     2345765
5    Nagaland     1934757

# 3 Creating DataFrame for CSV file